---
kind: method
id: M:Autodesk.Revit.DB.Analysis.AnalysisDisplayDiagramSettings.IsEqual(Autodesk.Revit.DB.Analysis.AnalysisDisplayDiagramSettings)
source: html/3aafe2e6-d765-acea-971a-70b5a21fcd47.htm
---
# Autodesk.Revit.DB.Analysis.AnalysisDisplayDiagramSettings.IsEqual Method

Compares two diagram settings objects.

## Syntax (C#)
```csharp
public bool IsEqual(
	AnalysisDisplayDiagramSettings other
)
```

## Parameters
- **other** (`Autodesk.Revit.DB.Analysis.AnalysisDisplayDiagramSettings`) - Diagram settings object to compare with.

## Returns
True if objects are equal, false otherwise.